---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d
source: html/cbf9b3a1-c331-4914-f2bd-dd2065de92cd.htm
---
# AssetPropertyDoubleArray3d Members

Adds a new connected asset attached to this asset property, if it allows it.